import { Layout } from 'antd'
import React from 'react'

type Props = {}

export const Legislation = (props: Props) => {
	return (
		<Layout.Content>
			<h2>Яка процедура оскарження штрафу?</h2>
			<p>
				Вимогами Кодексу України про адміністративні правопорушення
				передбачена можливість оскарження постанови про
				адміністративне правопорушення в судовому порядку.
			</p>
			<p>
				<b>Стаття 300-1.</b> Порядок виконання постанови про
				накладення адміністративного стягнення у вигляді штрафу за
				правопорушення у сфері забезпечення безпеки дорожнього руху,
				зафіксоване в автоматичному режимі, або про порушення правил
				зупинки, стоянки, паркування транспортних засобів, зафіксоване
				в режимі фотозйомки (відеозапису).У разі сплати відповідальною
				особою, зазначеною у частині першій статті 14-2 цього Кодексу,
				або громадянином (резидентом) України, який ввіз на територію
				України транспортний засіб, зареєстрований за межами України,
				50 відсотків розміру штрафу за постановою про накладення
				адміністративного стягнення за правопорушення у сфері
				забезпечення безпеки дорожнього руху, зафіксоване в
				автоматичному режимі, або за порушення правил зупинки,
				стоянки, паркування транспортних засобів, зафіксоване в режимі
				фотозйомки (відеозапису), до вручення такої постанови або
				отримання поштового повідомлення про вручення або про відмову
				в її отриманні, або повернення поштового відправлення з
				позначкою про невручення, або протягом десяти днів з дня
				набрання постановою законної сили така постанова вважається
				виконаною. Постанова про накладення адміністративного
				стягнення за порушення зупинки, стоянки та паркування
				транспортних засобів, зафіксоване в режимі фотозйомки
				(відеозапису), також вважається виконаною у разі сплати штрафу
				за повідомленням про притягнення до адміністративної
				відповідальності, залишеним уповноваженою посадовою особою на
				місці вчинення правопорушення на лобовому склі транспортного
				засобу, у тому числі шляхом сплати 50 відсотків розміру штрафу
				протягом десяти днів з дня вчинення відповідного
				правопорушення. У разі несплати штрафу особами, зазначеними у
				частині першій цієї статті, протягом 30 днів з дня набрання
				законної сили постановою про накладення адміністративного
				стягнення за правопорушення у сферах безпеки дорожнього руху
				та паркування транспортних засобів така постанова підлягає
				примусовому виконанню.
			</p>
		</Layout.Content>
	)
}
